# Rebar Crank Overridable Parameters Get Crank Start Offset Length Formula Params Method

Source: https://www.revitapidocs.com/2026/8f63624e-5d2b-c813-adc3-12188e03b48c.htm

---

| Rebar Crank Overridable Parameters Get Crank Start Offset Length Formula Params Method |
| --- |

Gets the formula parameter ids defined in the RebarShape family which are associated with start crank offset length parameters.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ISet<ElementId> GetCrankStartOffsetLengthFormulaParams()
```

```
Public Function GetCrankStartOffsetLengthFormulaParams As ISet(Of ElementId)
```

```
public:
ISet<ElementId^>^ GetCrankStartOffsetLengthFormulaParams()
```

```
member GetCrankStartOffsetLengthFormulaParams : unit -> ISet<ElementId>
```

#### Return Value

ISet ElementId
Returns the formula parameter ids defined in the RebarShape family which are associated with start crank offset length parameters. See Also

#### Reference

RebarCrankOverridableParameters Class Autodesk.Revit.DB.Structure Namespace